def solution(letter):
    # 1. 모스부호 딕셔너리 정의
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    # 2. 입력받은 문자열을 공백 기준으로 나누기
    words = letter.split(' ')
    
    # 3. 각 모스부호를 알파벳으로 변환하여 합치기
    answer = ''
    for m in words:
        answer += morse[m]
        
    return answer